[
  {
    "order": 1,
    "content": "الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "استحباب ابتداء الدعاء بالحمد لله -تعالى- والثناء، ثم الصلاة على رسول الله ﷺ",
    "source": "عن أنس يرفعه: ((لأن أقعد مع قوم يذكرون اللَّه تعالى من صلاة الغداة حتى تطلع الشمس أحبُّ إليَّ من أن أُعتق أربعة من ولد إسماعيل، ولأن أقعد مع قوم يذكرون اللَّه من صلاة العصر إلى أن تغرب الشمس أحبّ إليَّ من أن أعتق أربعة)). أبو داود، برقم 3667، وحسنه الألباني، في صحيح أبي داود، 2/698 .",
    "type": 0,
    "audio": "",
    "hadith_text": "",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 2,
    "content": "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾.",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "[سورة البقرة، الآية: 255] من قالها حين يصبح أُجير من الجن حتى يمسي، ومن قالها حين يمسي أُجير منهم حتى يصبح",
    "source": "أخرجه الحاكم، 1/562، وصححه الألباني في صحيح الترغيب والترهيب، 1/273، وعزاه إلى النسائي، والطبراني، وقال: ((إسناد الطبراني جيد))",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/75.mp3",
    "hadith_text": "عن أُبيِّ بنِ كَعْبٍ رضِي اللهُ عنه أنَّه كان له جُرْنٌ من تَمْرٍ فكان يَنقُصُ فحرسَه ذاتَ ليلةٍ فإذا هو بدابَّةٍ شِبْه الغُلامِ المُحتَلِمِ فسلَّمَ عليه فرَدَّ عليه السلامَ فقال ما أنت جِنِّيٌ أمْ إنْسيٌ قال جِنِّيٌ قال فناوِلْنِي يدَك قال فناوَلَه يدَه فإذا يدُه يدُ كلبٍ وشَعرُه شَعرُ كلبٍ قال هذا خَلْقُ الجِنِّ قال قدْ عَلِمتِ الجِنُّ أنَّ ما فيِهم رجلًا أشدَ مِنِّي قال فما جاء بِكَ قال بلَغَنَا أنَّكَ تُحِبُّ الصَّدقةَ فجِئْنا نُصيبُ من طعامِك قال فما يُنَجِّينَا مِنكُم قال هذه الآيةُ التِي في سورةِ البقرةِ اللَّهُ لا إِلَهَ إِلَّا هو الْحَيُّ الْقَيُّومُ مَنْ قالَها حِينَ يُمسِي أُجِيرَ مِنَّا حتَى يُصْبِحَ ومَن قالَها حينَ يصبحُ أُجِيرَ مِنَّا حتى يُمسِي فلَمَّا أصبحَ أتَى رسولُ اللهِ صلَّى اللهُ عليِه وسلَّمَ فذكر ذلكَ له فقال: صَدَقَ الخبيثُ",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 3,
    "content": "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ ﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾. [البقرة 285 - 286]",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
    "source": "أخرجه البخاري (4008)، ومسلم (807)",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/101.mp3",
    "hadith_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَلْقَمَةَ، عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُ\". قَالَ عَبْدُ الرَّحْمَنِ: فَلَقِيتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ، فَسَأَلْتُهُ، فَحَدَّثَنِيهِ.",
    "explanation_of_hadith_vocabulary": "- قوله: ((كفتاه)) أي: كفتاه من الآفات في ليلته"
  },
  {
    "order": 4,
    "content": "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
    "source": "أخرجه أبو داود، 4/ 322، برقم 5082، والترمذي، 5/ 567، برقم 3575، وانظر: صحيح الترمذي، 3/182،",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/112.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 5,
    "content": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
    "source": "أخرجه أبو داود، 4/ 322، برقم 5082، والترمذي، 5/ 567، برقم 3575، وانظر: صحيح الترمذي، 3/182،",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/113.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 6,
    "content": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
    "source": "أخرجه أبو داود، 4/ 322، برقم 5082، والترمذي، 5/ 567، برقم 3575، وانظر: صحيح الترمذي، 3/182،",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/114.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 7,
    "content": "أَصْبَحْنَا وَأَصْبَحَ الْملْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْملْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "مسلم، 4/ 2088، برقم 2723",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/77.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ النَّخَعِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمْسَى قَالَ: \"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\". قَالَ الْحَسَنُ: فَحَدَّثَنِي الزُّبَيْدُ أَنَّهُ حَفِظَ عَنْ إِبْرَاهِيمَ فِي هَذَا \"لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ، وَعَذَابٍ فِي الْقَبْرِ\".",
    "explanation_of_hadith_vocabulary": "‏قوله صلى الله عليه وسلم: (اللهم إني أعوذ بك من الكسل وسوء الكبر) قال القاضي: رويناه \"الكبر \"بإسكان الباء وفتحها، فالإسكان بمعنى: التعاظم على الناس، والفتح بمعنى: الهرم والخرف والرد إلى أرذل العمر، كما في الحديث الآخر، قال القاضي: وهذا أظهر وأشهر مما قبله، قال: وبالفتح ذكره الهروي، وبالوجهين ذكره الخطابي، وصوب الفتح، وتعضده رواية النسائي: \"وسوء العمر \"."
  },
  {
    "order": 8,
    "content": "أمسينا وأمسى الملك للَّه، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة، وشر ما بعدها، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "مسلم، 4/ 2088، برقم 2723",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/77.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ النَّخَعِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمْسَى قَالَ: \"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\". قَالَ الْحَسَنُ: فَحَدَّثَنِي الزُّبَيْدُ أَنَّهُ حَفِظَ عَنْ إِبْرَاهِيمَ فِي هَذَا \"لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ، وَعَذَابٍ فِي الْقَبْرِ\".",
    "explanation_of_hadith_vocabulary": "‏قوله صلى الله عليه وسلم: (اللهم إني أعوذ بك من الكسل وسوء الكبر) قال القاضي: رويناه \"الكبر \"بإسكان الباء وفتحها، فالإسكان بمعنى: التعاظم على الناس، والفتح بمعنى: الهرم والخرف والرد إلى أرذل العمر، كما في الحديث الآخر، قال القاضي: وهذا أظهر وأشهر مما قبله، قال: وبالفتح ذكره الهروي، وبالوجهين ذكره الخطابي، وصوب الفتح، وتعضده رواية النسائي: \"وسوء العمر \"."
  },
  {
    "order": 9,
    "content": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "الترمذي، 5/ 466، برقم 3391، وانظر: صحيح الترمذي 3/142",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/78.mp3",
    "hadith_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُ أَصْحَابَهُ يَقُولُ:\"إِذَا أَصْبَحَ أَحَدُكُمْ ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ، وَإِذَا أَمْسَى ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ ",
    "explanation_of_hadith_vocabulary": "النشور: البعث يوم القيامة."
  },
  {
    "order": 10,
    "content": "اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نموتُ، وإليكَ المصيرُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "الترمذي، 5/ 466، برقم 3391، وانظر: صحيح الترمذي 3/142",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/78.mp3",
    "hadith_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُ أَصْحَابَهُ يَقُولُ:\"إِذَا أَصْبَحَ أَحَدُكُمْ ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ، وَإِذَا أَمْسَى ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ ",
    "explanation_of_hadith_vocabulary": "النشور: البعث يوم القيامة."
  },
  {
    "order": 11,
    "content": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ",
    "source": "أخرجه البخاري، 7/ 150، برقم 6306",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/79.mp3",
    "hadith_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، قَالَ: حَدَّثَنِي شَدَّادُ بْنُ أَوْسٍ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ: اللَّهُمَّ أَنْتَ رَبِّي، لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي ؛ فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ\". قَالَ: \"وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ\".",
    "explanation_of_hadith_vocabulary": "أبوء: أقر وأعترف."
  },
  {
    "order": 12,
    "content": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
    "count": 4,
    "count_description": "أَربَعُ مَرَّاتٍ",
    "fadl": "من قالها حين يصبح، أو يمسي أربع مرات، أعتقه اللَّه من النار",
    "source": "أخرجه أبو داود، 4/ 317، برقم 5069، والبخاري في الأدب المفرد، برقم 1201، والنسائي في عمل اليوم والليلة، برقم 9، وابن السني، برقم 70، وحسّن سماحة الشيخ ابن باز ‘ إسناد النسائي، وأبي داود، في تحفة الأخيار، ص23",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/80.mp3",
    "hadith_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ هِشَامِ بْنِ الْغَازِ بْنِ رَبِيعَةَ، عَنْ مَكْحُولٍ الدِّمَشْقِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ أَوْ يُمْسِي: اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ. أَعْتَقَ اللَّهُ رُبُعَهُ مِنَ النَّارِ، فَمَنْ قَالَهَا مَرَّتَيْنِ أَعْتَقَ اللَّهُ نِصْفَهُ، وَمَنْ قَالَهَا ثَلَاثًا أَعْتَقَ اللَّهُ ثَلَاثَةَ أَرْبَاعِهِ، فَإِنْ قَالَهَا أَرْبَعًا أَعْتَقَهُ اللَّهُ مِنَ النَّارِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 13,
    "content": "اللَّهم إني أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
    "count": 4,
    "count_description": "أَربَعُ مَرَّاتٍ",
    "fadl": "من قالها حين يصبح، أو يمسي أربع مرات، أعتقه اللَّه من النار",
    "source": "أخرجه أبو داود، 4/ 317، برقم 5069، والبخاري في الأدب المفرد، برقم 1201، والنسائي في عمل اليوم والليلة، برقم 9، وابن السني، برقم 70، وحسّن سماحة الشيخ ابن باز ‘ إسناد النسائي، وأبي داود، في تحفة الأخيار، ص23",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/80.mp3",
    "hadith_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ هِشَامِ بْنِ الْغَازِ بْنِ رَبِيعَةَ، عَنْ مَكْحُولٍ الدِّمَشْقِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ أَوْ يُمْسِي: اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ. أَعْتَقَ اللَّهُ رُبُعَهُ مِنَ النَّارِ، فَمَنْ قَالَهَا مَرَّتَيْنِ أَعْتَقَ اللَّهُ نِصْفَهُ، وَمَنْ قَالَهَا ثَلَاثًا أَعْتَقَ اللَّهُ ثَلَاثَةَ أَرْبَاعِهِ، فَإِنْ قَالَهَا أَرْبَعًا أَعْتَقَهُ اللَّهُ مِنَ النَّارِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 14,
    "content": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته",
    "source": "أخرجه أبو داود، 4/ 318، برقم 5073، والنسائي في عمل اليوم والليلة، برقم 7، وابن السني، برقم 41، وابن حبان، ((موارد)) برقم 2361، وحسّن ابن باز ‘ إسناده في تحفة الأخيار، ص24",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/81.mp3",
    "hadith_text": ",حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ وَإِسْمَاعِيلُ، قَالَا: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَنْبَسَةَ، عَنْ عَبْدِ اللَّهِ بْنِ غَنَّامٍ الْبَيَاضِيِّ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. فَقَدْ أَدَّى شُكْرَ يَوْمِهِ، وَمَنْ قَالَ مِثْلَ ذَلِكَ حِينَ يُمْسِي فَقَدْ أَدَّى شُكْرَ لَيْلَتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 15,
    "content": "اللَّهم ما أمسى بي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته",
    "source": "أخرجه أبو داود، 4/ 318، برقم 5073، والنسائي في عمل اليوم والليلة، برقم 7، وابن السني، برقم 41، وابن حبان، ((موارد)) برقم 2361، وحسّن ابن باز ‘ إسناده في تحفة الأخيار، ص24",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/81.mp3",
    "hadith_text": ",حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ وَإِسْمَاعِيلُ، قَالَا: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَنْبَسَةَ، عَنْ عَبْدِ اللَّهِ بْنِ غَنَّامٍ الْبَيَاضِيِّ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. فَقَدْ أَدَّى شُكْرَ يَوْمِهِ، وَمَنْ قَالَ مِثْلَ ذَلِكَ حِينَ يُمْسِي فَقَدْ أَدَّى شُكْرَ لَيْلَتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 16,
    "content": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "",
    "source": "أبو داود، 4/ 324، برقم 5090، وأحمد، 5/ 42، برقم 20430، والنسائي في عمل اليوم والليلة، برقم 22، وابن السني، برقم 69، والبخاري في الأدب المفرد، برقم 701، وحسّن العلامة ابن باز ‘ إسناده في تحفة الأخيار، ص26",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/82.mp3",
    "hadith_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، عَنْ عَبْدِ الْجَلِيلِ بْنِ عَطِيَّةَ، عَنْ جَعْفَرِ بْنِ مَيْمُونٍ، قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، أَنَّهُ قَالَ لِأَبِيهِ: يَا أَبَتِ، إِنِّي أَسْمَعُكَ تَدْعُو كُلَّ غَدَاةٍ: \"اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ\". تُعِيدُهَا ثَلَاثًا حِينَ تُصْبِحُ، وَثَلَاثًا حِينَ تُمْسِي ؟ فَقَالَ: إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِنَّ، فَأَنَا أُحِبُّ أَنْ أَسْتَنَّ بِسُنَّتِهِ. قَالَ عَبَّاسٌ فِيهِ: وَتَقُولُ: \"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ\". تُعِيدُهَا ثَلَاثًا حِينَ تُصْبِحُ وَثَلَاثًا حِينَ تُمْسِي، فَتَدْعُو بِهِنَّ، فَأُحِبُّ أَنْ أَسْتَنَّ بِسُنَّتِهِ. قَالَ: وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"دَعَوَاتُ الْمَكْرُوبِ: اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أَنْتَ\". وَبَعْضُهُمْ يَزِيدُ عَلَى صَاحِبِهِ.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 17,
    "content": "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "count": 7,
    "count_description": "سَبعُ مَرَّاتٍ",
    "fadl": "من قالها حين يصبح وحين يمسي سبع مرات كفاه اللَّه ما أهمّه من أمر الدنيا والآخرة",
    "source": "أخرجه ابن السني، برقم 71 مرفوعاً، وأبو داود موقوفاً، 4/ 321، برقم 5081، وصحّح إسناده شعيب وعبدالقادر الأرناؤوط. انظر: زاد المعاد 2/376",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/83.mp3",
    "hadith_text": "لفظ أبو داود: حَدَّثَنَا يَزِيدُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ مُسْلِمٍ الدِّمَشْقِيُّ - وَكَانَ مِنْ ثِقَاتِ الْمُسْلِمِينَ مِنَ الْمُتَعَبِّدِينَ - قَالَ: حَدَّثَنَا مُدْرِكُ بْنُ سَعْدٍ - قَالَ يَزِيدُ: شَيْخٌ ثِقَةٌ - عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى: { حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ } سَبْعَ مَرَّاتٍ كَفَاهُ اللَّهُ مَا أَهَمَّهُ، صَادِقًا كَانَ بِهَا أَوْ كَاذِبًا.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 18,
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أبو داود، برقم 5074، وابن ماجه، برقم 3871، وانظر: صحيح ابن ماجه، 2/332",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/84.mp3",
    "hadith_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى، حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا عُبَادَةُ بْنُ مُسْلِمٍ الْفَزَارِيُّ، عَنْ جُبَيْرِ بْنِ أَبِي سُلَيْمَانَ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ يَقُولُ: لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ: \"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَتِي - وَقَالَ عُثْمَانُ: عَوْرَاتِي - وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي\". \nقَالَ أَبُو دَاوُدَ: قَالَ وَكِيعٌ: يَعْنِي الْخَسْفَ.",
    "explanation_of_hadith_vocabulary": "- رَوْعَاتِي: جمع رَوعة، وهي الفزعة، والمعنى: ادفع عني ما يفزعني ويزعجني.\n- أُغْتَالَ: أي: أهلك من حيث لا أشعر، يريد به الخسف."
  },
  {
    "order": 19,
    "content": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "الترمذي، برقم 3392، وأبو داود، برقم 5067،. وانظر: صحيح الترمذي، 3/142",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/85.mp3",
    "hadith_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، قَالَ: حَدَّثَنَا أَبُو دَاوُدَ، قَالَ: أَخْبَرَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، قَالَ: سَمِعْتُ عَمْرَو بْنَ عَاصِمٍ الثَّقَفِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللَّهِ، مُرْنِي بِشَيْءٍ أَقُولُهُ إِذَا أَصْبَحْتُ، وَإِذَا أَمْسَيْتُ، قَالَ: \"قُلِ: اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ\". قَالَ: \"قُلْهُ إِذَا أَصْبَحْتَ، وَإِذَا أَمْسَيْتَ، وَإِذَا أَخَذْتَ مَضْجَعَكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 20,
    "content": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها ثلاثاً إذا أصبح، وثلاثاً إذا أمسى لم يضره شيء",
    "source": "أخرجه أبو داود، 4/ 323، برقم، 5088، والترمذي، 5/ 465، برقم 3388، وابن ماجه، برقم 3869، وأحمد، برقم 446. وانظر: صحيح ابن ماجه، 2/332، وحسّن إسناده العلامة ابن باز ‘ في تحفة الأخيار، ص39",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/86.mp3",
    "hadith_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا أَبُو مَوْدُودٍ، عَمَّنْ سَمِعَ أَبَانَ بْنَ عُثْمَانَ يَقُولُ: سَمِعْتُ عُثْمَانَ - يَعْنِي ابْنَ عَفَّانَ - يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"مَنْ قَالَ: بِاسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ، ثَلَاثَ مَرَّاتٍ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ\". قَالَ: فَأَصَابَ أَبَانَ بْنَ عُثْمَانَ الْفَالِجُ، فَجَعَلَ الرَّجُلُ الَّذِي سَمِعَ مِنْهُ الْحَدِيثَ يَنْظُرُ إِلَيْهِ، فَقَالَ لَهُ: مَا لَكَ تَنْظُرُ إِلَيَّ ؟ فَوَاللَّهِ مَا كَذَبْتُ عَلَى عُثْمَانَ، وَلَا كَذَبَ عُثْمَانُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَلَكِنَّ الْيَوْمَ الَّذِي أَصَابَنِي فِيهِ مَا أَصَابَنِي غَضِبْتُ فَنَسِيتُ أَنْ أَقُولَهَا.",
    "explanation_of_hadith_vocabulary": "الفالج: شلل يصيب أحد شقي الجسم طولا."
  },
  {
    "order": 21,
    "content": "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ ﷺ نَبِيًّا",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها ثلاثاً حين يصبح وثلاثاً حين يمسي كان حقاً على اللَّه أن يرضيه يوم القيامة",
    "source": "أحمد، 4/ 337، برقم 18967، والنسائي في عمل اليوم والليلة، برقم 4، وابن السني، برقم 68، وأبو داود، 4/ 318، برقم 1531، والترمذي، 5/ 465، برقم، 3389، وحسّنه ابن باز ‘ في تحفة الأخيار ص39",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/87.mp3",
    "hadith_text": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَقِيلٍ - قَاضِي وَاسِطٍ - عَنْ سَابِقِ بْنِ نَاجِيَةَ، عَنْ أَبِي سَلَّامٍ، قَالَ: مَرَّ رَجُلٌ فِي مَسْجِدِ حِمْصَ، فَقَالُوا: هَذَا خَدَمَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ: فَقُمْتُ إِلَيْهِ، فَقُلْتُ: حَدِّثْنِي حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، لَا يَتَدَاوَلُهُ بَيْنَكَ وَبَيْنَهُ الرِّجَالُ. قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ: رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا. إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 22,
    "content": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "الحاكم وصححه، ووافقه الذهبي، 1/545، وانظر: صحيح الترغيب والترهيب، 1/273",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/88.mp3",
    "hadith_text": "قالَ رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ لفاطمةَ: ما يَمنعُكِ أنْ تَسمَعي ما أُوصيكِ به أنْ تَقولي إذا أَصبحتِ، وإذا أَمسيتِ: يا حيُّ يا قيُّومُ برحمتِكَ أَستغيثُ، أَصلِحْ لي شأني كُلَّهُ، ولا تَكِلْني إلى نَفسي طرْفةَ عينٍ",
    "explanation_of_hadith_vocabulary": "كان النَّبيُّ صلَّى اللهُ عليه وسلَّم خَيرَ النَّاسِ لأهلِه وأولادِه، فكان يَحرِصُ على أن يُعَلِّمَهم ما يَنفعُهم في دينِهم، ويوصيهم بالخَيرِ، ومن ذلك أنَّه صلَّى اللهُ عليه وسلَّم قال لابنَتِه فاطِمةَ رَضِيَ اللهُ عنها: ما يَمنَعُكِ أن تَسمَعي ما أوصيك به؟ أي: هل هناكَ شَيءٌ يَحولُ بَينَك وبَينَ سَماعِ وصيَّتي لكِ؟ ثمَّ أوصاها إذا أصبَحَت -أي: دَخَلت في وقتِ الصَّباحِ-، وإذا أمسَت -أي: دَخَلت في وقتِ المَساءِ- أن تَقولَ: يا حَيُّ يا قَيُّومُ، وهما اسمانِ من أسماءِ اللهِ تعالى، فالحَيُّ: جامِعٌ لصِفاتِ الذَّاتِ، والقَيُّومُ: جامِعٌ لصِفاتِ الأفعالِ، وجَمعُهما في غايةِ المُناسَبةِ كما جَمَعَهما اللهُ في عِدَّةِ مَواضِعَ من كِتابِه؛ وذلك أنَّهما مُحتَويانِ على جَميعِ صِفاتِ الكَمالِ، بك أستَغيثُ، أي: أطلُبُ الغَوثَ منك يا اللَّهُ، أن تُصلِحَ لي شَأني، أي: أمري، بأن تَجعَلَه صالحًا لا فسادَ يَلحَقُه، ولا تَكِلْني، أي: لا تَترُكْني إلى نَفسي وتَدبيرِها ونَظَرِها لِما يَنفعُها؛ فإنَّ النَّفسَ عاجِزةٌ عن مَعرِفةِ مَصلحَتِها، طَرفةَ عَينٍ، أي: لحظةً ولمحةً، والمَعنى: لا تُفوِّضْ أمري إلى نَفسي لحظةً قَليلةً قَدْرَ ما يَتَحَرَّكُ البَصَرُ.\nوفي الحَديثِ: بَيانُ ما كان عليه النَّبيُّ صلَّى اللهُ عليه وسلَّم منَ الاهتِمامِ بأبنائِه.\nوفيه أهَمِّيَّةُ رِعايةِ الأولادِ وتَعليمِهم ما يَنفعُهم في دينِهم ودُنياهم.\nوفيه مَشروعيَّةُ قَولِ: يا حَيُّ يا قَيُّومُ، بك أستَغيثُ؛ فأصلِحْ لي شَأني، ولا تَكِلْني إلى نَفسي طَرفةَ عَينٍ في الصَّباحِ والمَساءِ.\nوفيه سُؤالُ اللهِ تعالى بأسمائِه الحُسنى.\nوفيه تَفويضُ العَبدِ جَميعَ أمورِه إلى اللهِ تعالى."
  },
  {
    "order": 23,
    "content": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أبو داود، 4/ 322، برقم 5084، وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد، 2/373",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/89.mp3",
    "hadith_text": "قَالَ أَبُو دَاوُدَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنِي  أَبِي - قَالَ ابْنُ عَوْفٍ: وَرَأَيْتُهُ فِي أَصْلِ إِسْمَاعِيلَ - قَالَ: حَدَّثَنِي ضَمْضَمٌ، عَنْ شُرَيْحٍ، عَنْ أَبِي مَالِكٍ وَبِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ ؛ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ. ثُمَّ إِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 24,
    "content": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أبو داود، 4/ 322، برقم 5084، وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد، 2/373",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/89.mp3",
    "hadith_text": "قَالَ أَبُو دَاوُدَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنِي  أَبِي - قَالَ ابْنُ عَوْفٍ: وَرَأَيْتُهُ فِي أَصْلِ إِسْمَاعِيلَ - قَالَ: حَدَّثَنِي ضَمْضَمٌ، عَنْ شُرَيْحٍ، عَنْ أَبِي مَالِكٍ وَبِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ ؛ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ. ثُمَّ إِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 25,
    "content": "أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أحمد، 3/ 406، و407، برقم 15360، ورقم 15563، وابن السني في عمل اليوم والليلة، برقم 34، وانظر: صحيح الجامع، 4/209",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/90.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \"أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ\".",
    "explanation_of_hadith_vocabulary": "قوله (أصبحنا) أي: دخلنا في الصباح، وهذا الدعاء من أذكار الصباح (على فطرة الإسلام) الجار والمجرور حال: ونحن على فطرة الإسلام، أي: على السنة التي سنها الله تعالى لعباده، وهي الإسلام، فالإضافة بيانية (كلمة الإخلاص) أي: كلمة تدل على إخلاص القائل ويصير بها القائل من المخلصين، وهي كلمة التوحيد (وعلى دين نبينا) يدل على أن النبي مبعوث إلى نفسه حتى له أن يضيف اسم النبي إلى نفسه  لذلك (ملة أبينا) أي: دينه (حنيفا) مائلا عن الباطل حال من (إبراهيم)."
  },
  {
    "order": 26,
    "content": "أمسينا على فطرة الإسلام، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أحمد، 3/ 406، و407، برقم 15360، ورقم 15563، وابن السني في عمل اليوم والليلة، برقم 34، وانظر: صحيح الجامع، 4/209",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/90.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \"أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ\".",
    "explanation_of_hadith_vocabulary": "قوله (أصبحنا) أي: دخلنا في الصباح، وهذا الدعاء من أذكار الصباح (على فطرة الإسلام) الجار والمجرور حال: ونحن على فطرة الإسلام، أي: على السنة التي سنها الله تعالى لعباده، وهي الإسلام، فالإضافة بيانية (كلمة الإخلاص) أي: كلمة تدل على إخلاص القائل ويصير بها القائل من المخلصين، وهي كلمة التوحيد (وعلى دين نبينا) يدل على أن النبي مبعوث إلى نفسه حتى له أن يضيف اسم النبي إلى نفسه  لذلك (ملة أبينا) أي: دينه (حنيفا) مائلا عن الباطل حال من (إبراهيم)."
  },
  {
    "order": 27,
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
    "count": 1,
    "count_description": "مَرَّةٌ وَاحِدَةٌ",
    "fadl": "",
    "source": "أخرجه ابن السني في ((عمل اليوم والليلة)) برقم (54)، وابن ماجة برقم (925)، وحسن إسناده عبدالقادر وشعيب الأرناؤوط، في تحقيق ((زاد المعاد)) (2/375)",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/95.mp3",
    "hadith_text": "925 حدثنا أبو بكر بن أبي شيبة حدثنا شبابة حدثنا شعبة عن موسى بن أبي عائشة عن مولى لأم سلمة عن أم سلمة أن النبي صلى الله عليه وسلم كانَ يقولُ إذا صلَّى الصُّبحَ حينَ يسلِّمُ اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 28,
    "content": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "count": 10,
    "count_description": "عَشرَ مَرَّاتٍ أَو مَرَّةً وَاحِدَةً عِندَ الكَسَلِ",
    "fadl": "عشرَ مرَّات أَوْ مرَّةً واحدةً عندَ الكَسَلِ، ومن قالها عَشْرَ مِرَارٍ كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ.",
    "source": "صحيح البخاري: 6404، صحيح مسلم: 2693، النسائي في عمل اليوم والليلة، برقم 24، وانظر: صحيح الترغيب والترهيب، 1/272، وتحفة الأخيار لابن باز ‘، ص44، وانظر فضلها في: ص146، حديث، رقم 255 مرَّةً واحدةً عندَ الكَسَلِ: أبو داود، برقم 5077، وابن ماجه، برقم 3798، وأحمد، برقم 8719، وانظر: صحيح الترغيب والترهيب، 1/270، وصحيح أبي داود، 3/957، وصحيح ابن ماجه، 2/331، وزاد المعاد، 2/377",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/92.mp3",
    "hadith_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ أَبُو أَيُّوبَ الْغَيْلَانِيُّ، حَدَّثَنَا أَبُو عَامِرٍ - يَعْنِي الْعَقَدِيَّ - حَدَّثَنَا عُمَرُ - وَهُوَ ابْنُ أَبِي زَائِدَةَ - عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ: مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. عَشْرَ مِرَارٍ - كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ. وَقَالَ سُلَيْمَانُ: حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا عُمَرُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ رَبِيعِ بْنِ خُثَيْمٍ، بِمِثْلِ ذَلِكَ، قَالَ: فَقُلْتُ لِلرَّبِيعِ: مِمَّنْ سَمِعْتَهُ ؟ قَالَ: مِنْ عَمْرِو بْنِ مَيْمُونٍ. قَالَ: فَأَتَيْتُ عَمْرَو بْنَ مَيْمُونٍ، فَقُلْتُ: مِمَّنْ سَمِعْتُهُ ؟ قَالَ: مِنِ ابْنِ أَبِي لَيْلَى. قَالَ: فَأَتَيْتُ ابْنَ أَبِي لَيْلَى، فَقُلْتُ: مِمَّنْ سَمِعْتُهُ ؟ قَالَ: مِنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ يُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 29,
    "content": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
    "count": 10,
    "count_description": "عَشرُ مَرَّاتٍ",
    "fadl": "من صلّى عليَّ حين يصبح عشراً، وحين يمسي عشراً، أدركته شفاعتي يوم القيامة",
    "source": "أخرجه الطبراني بإسنادين أحدهما جيد، انظر: مجمع الزوائد (10/120)، وصحيح الترغيب والترهيب (1/273) [برقم (656)]، وضعيف الترغيب والترهيب برقم: 396. وفي السلسلة الضعيفة برقم: 5788.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/98.mp3",
    "hadith_text": "عن أبي الدرداء- رضي الله تعالى عنه- قال: قال رسول الله -صلى الله عليه وسلم-: (من صلَّى عليَّ حينَ يصبحُ عشرًا وحينَ يمسي عشرًا أدرَكتْهُ شفاعتي يومَ القيامةِ)",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 30,
    "content": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "من قالها حين يمسي ثلاث مرات لم تضرّه حُمَة تلك الليلة",
    "source": "، أخرجه أحمد، 2/ 290، برقم 7898، والنسائي في عمل اليوم والليلة، برقم 590، وابن السني، برقم 68، وانظر: صحيح الترمذي، 3/187، وصحيح ابن ماجه، 2/266، وتحفة الأخيار لابن باز، ص45",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/97.mp3",
    "hadith_text": "حَدَّثَنَا يَزِيدُ، أَخْبَرَنَا هِشَامٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَنْ قَالَ إِذَا أَمْسَى ثَلَاثَ مَرَّاتٍ: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ، لَمْ تَضُرَّهُ حُمَةٌ تِلْكَ اللَّيْلَةَ\". قَالَ: فَكَانَ أَهْلُنَا قَدْ تَعَلَّمُوهَا فَكَانُوا يَقُولُونَهَا، فَلُدِغَتْ جَارِيَةٌ مِنْهُمْ، فَلَمْ تَجِدْ لَهَا وَجَعًا.",
    "explanation_of_hadith_vocabulary": "قوله (التامات): الوافيات في أداء معانيها أو الكاملات: التي لا نقص في شيء منها ولا عيب أو النافعات للمتعوذ بها الحافظات له من الآفات. قيل: هي علمه تعالى أو كلامه أو القرآن وقيل: أراد بها أسماءه الحسنى وكتبه المنزلة لخلوها من النواقص والعوارض بخلاف كلمات الناس. (حمة) بضم مهملة وتخفيف ميم وتشديد: السم ويطلق على إبرة العقرب المجاورة لأن السم منها يخرج."
  },
  {
    "order": 31,
    "content": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ",
    "count": 3,
    "count_description": "ثَلَاثُ مَرَّاتٍ",
    "fadl": "",
    "source": "مسلم، 4/ 2090، برقم 2726",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/94.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ - قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ، فَقَالَ: \"مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا ؟ \"قَالَتْ: نَعَمْ. قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 32,
    "content": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "count": 100,
    "count_description": "مِائَةُ مَرَّةٍ",
    "fadl": "من قالها مائة مرة في يوم كانت له عدل عشر رقاب، وكُتِبَ له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك",
    "source": "البخاري، 4/ 95، برقم 3293، ومسلم، 4/ 2071، برقم 2691\nعشرَ مرَّات: النسائي في عمل اليوم والليلة، برقم 24، وانظر: صحيح الترغيب والترهيب، 1/272، وتحفة الأخيار لابن باز ‘، ص44، وانظر فضلها في: ص146، حديث، رقم 255 مرَّةً واحدةً عندَ الكَسَلِ: أبو داود، برقم 5077، وابن ماجه، برقم 3798، وأحمد، برقم 8719، وانظر: صحيح الترغيب والترهيب، 1/270، وصحيح أبي داود، 3/957، وصحيح ابن ماجه، 2/331، وزاد المعاد، 2/377",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/93.mp3",
    "hadith_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 33,
    "content": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
    "count": 100,
    "count_description": "مِائَةُ مَرَّةٍ فِي اليَومِ",
    "fadl": "",
    "source": "البخاري مع ((الفتح)) (11/101) [برقم (6307)]، ومسلم (4/2075) [برقم (2702)]",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/96.mp3",
    "hadith_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"وَاللَّهِ إِنِّي لَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 34,
    "content": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "count": 100,
    "count_description": "مِائَةُ مَرَّةٍ",
    "fadl": "من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه",
    "source": "مسلم، 4/ 2071 برقم 2692",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/91.mp3",
    "hadith_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، عَنْ سُهَيْلٍ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ. مِائَةَ مَرَّةٍ - لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ، أَوْ زَادَ عَلَيْهِ\".",
    "explanation_of_hadith_vocabulary": ""
  }
]
