[
  {
    "order": 1,
    "content": "الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ",
    "translation": "All praise is due to Allah alone, and peace and blessings be upon him after whom there is no other Prophet.",
    "transliteration": "Alḥamdulillahi waḥdah waṣ-ṣalatu was-salam `alā man lā nabiyya ba`dah.",
    "count": 1,
    "count_description": "Once",
    "fadl": "The recommendation to begin supplication with praise to Allah the Exalted and extolling Him, followed by prayers upon the Messenger of Allah ﷺ.",
    "source": "Anas (RA) said that he heard the Prophet (ﷺ) say: \"That I sit with people remembering Almighty Allah from the morning (Fajr) prayer until sunrise is more beloved to me than freeing four slaves from among the Children of Isma'il. That I sit with people remembering Allah from the afternoon ('Asr) prayer, until the sun sets, is more beloved to me than freeing four slaves from among the Children of Isma'il.\"This was reported by Abu Dawud (No. 3667). Al-Albani graded it good in Sahih Abu Dawud 2/698.",
    "type": 0,
    "audio": "",
    "hadith_text": "",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 2,
    "content": "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾.",
    "translation": "Allah! There is none worthy of worship but He, the Ever-Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.",
    "transliteration": "(A`ūdhu billāhi min ash-shaytāni 'r-rajīm)\nAllāhu lā ilāha illā huwa ‘l-Ḥayyul-Qayyūm,\nlā ta'khudhuhu sinatun wa lā nawm,\nlahu mā fis-samāwāti wa māfil-arḍ,\nman dhal-ladhī yashfa`u `indahu illā bi'idhnih,\nya`lamu mā bayna aydīhim wa mā khalfahum,\nwa lā yuḥīṭūna bishay'im-min `ilmihi illā bimā shā',\nwasi`a kursiyyuhus-samāwāti wal-arḍ,\nwa lā ya'ūduhu hifẓuhumā,\nwa huwal-`Aliyyu‘l-`Aẓīm.",
    "count": 1,
    "count_description": "Once",
    "fadl": "(Ayat al-Kursi; Al-Qur'an 2:255) Whoever says this when he rises in the morning will be protected from jinns until he retires in the evening, and whoever says it when retiring in the evening will be protected from them until he rises in the morning.",
    "source": "It was reported by Al-Hakim 1 / 562, Al-Albani graded it as authentic in Sahihut-Targhib wat-Tarhib 1/273, and traces it to An-Nasa'i and At-Tabarani. He says that At-Tabarani's chain of transmission is reliable (Jayyid).",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/75.mp3",
    "hadith_text": "عن أُبيِّ بنِ كَعْبٍ رضِي اللهُ عنه أنَّه كان له جُرْنٌ من تَمْرٍ فكان يَنقُصُ فحرسَه ذاتَ ليلةٍ فإذا هو بدابَّةٍ شِبْه الغُلامِ المُحتَلِمِ فسلَّمَ عليه فرَدَّ عليه السلامَ فقال ما أنت جِنِّيٌ أمْ إنْسيٌ قال جِنِّيٌ قال فناوِلْنِي يدَك قال فناوَلَه يدَه فإذا يدُه يدُ كلبٍ وشَعرُه شَعرُ كلبٍ قال هذا خَلْقُ الجِنِّ قال قدْ عَلِمتِ الجِنُّ أنَّ ما فيِهم رجلًا أشدَ مِنِّي قال فما جاء بِكَ قال بلَغَنَا أنَّكَ تُحِبُّ الصَّدقةَ فجِئْنا نُصيبُ من طعامِك قال فما يُنَجِّينَا مِنكُم قال هذه الآيةُ التِي في سورةِ البقرةِ اللَّهُ لا إِلَهَ إِلَّا هو الْحَيُّ الْقَيُّومُ مَنْ قالَها حِينَ يُمسِي أُجِيرَ مِنَّا حتَى يُصْبِحَ ومَن قالَها حينَ يصبحُ أُجِيرَ مِنَّا حتى يُمسِي فلَمَّا أصبحَ أتَى رسولُ اللهِ صلَّى اللهُ عليِه وسلَّمَ فذكر ذلكَ له فقال: صَدَقَ الخبيثُ",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 3,
    "content": "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ ﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾. [البقرة 285 - 286]",
    "translation": "(285) The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], We make no distinction between any of His messengers. And they say, We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination. (286) Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
    "transliteration": "Aamanar-Rasoolu bimaaa unzila ilaihi mir-Rabbihee walmu'minoon; kullun aamana billaahi wa Malaaa'ikathihee wa Kutubhihee wa Rusulihee laa nufarriqu baina ahadim-mir-Rusulih wa qaaloo sami'naa wa ata'naa ghufraanaka Rabbanaa wa ilaikal-maseer (285)\nLaa yukalliful-laahu nafsan illaa wus'ahaa; lahaa maa kasabat wa 'alaihaa maktasabat; Rabbanaa laa tu'aakhiznaaa in naseenaaa aw akhtaanaa; Rabbanaa wa laa tahmil-'alainaaa isran kamaa hamaltahoo 'alal-lazeena min qablinaa; Rabbanaa wa laa tuhammilnaa maa laa taaqata lanaa bih; wa'fu 'annaa waghfir lanaa warhamnaa; Anta mawlaanaa fansurnaa 'alal qawmil kaafireen (286)",
    "count": 1,
    "count_description": "Once",
    "fadl": "Al-Baqarah 2:285-6. These two Verses will be sufficient for anyone who recites them at night before sleeping.",
    "source": "It was narrated by Al-Bukhari, No. 4008, and Muslim, No. 807.",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/101.mp3",
    "hadith_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَلْقَمَةَ، عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُ\". قَالَ عَبْدُ الرَّحْمَنِ: فَلَقِيتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ، فَسَأَلْتُهُ، فَحَدَّثَنِيهِ.",
    "explanation_of_hadith_vocabulary": "- قوله: ((كفتاه)) أي: كفتاه من الآفات في ليلته"
  },
  {
    "order": 4,
    "content": "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
    "translation": "(1) Say, He is Allah, [who is] One, (2) Allah, the Eternal Refuge.(3) He neither begets nor is born,(4) Nor is there to Him any equivalent.",
    "transliteration": "Bismillaahir Rahmaanir Raheem \"Qul huwal laahu ahad (1) Allah hus-samad (2) Lam yalid wa lam yoolad (3) Wa lam yakul-lahoo kufuwan ahad (4)",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Al-Ikhlas 112:1-4, Al-Falaq 113:1-5, An-Nas 114:1-6. Whoever recites these three times in the morning and in the evening, they will suffice him (as a protection) against everything.",
    "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmidhi 5/567. See Al-Albani's Sahih At-Tirmidhi 3/182.",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/112.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 5,
    "content": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "translation": "(1) Say, I seek refuge in the Lord of daybreak (2) From the evil of that which He created (3) And from the evil of darkness when it settles (4) And from the evil of the blowers in knots (5) And from the evil of an envier when he envies.",
    "transliteration": "Bismillaahir Rahmaanir Raheem \"Qul a'oozu bi rabbil-falaq (1) Min sharri maa khalaq (2) Wa min sharri ghaasiqin izaa waqab (3) Wa min sharrin-naffaa-taati fil 'uqad (4) Wa min sharri haasidin izaa hasad (5)",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Al-Ikhlas 112:1-4, Al-Falaq 113:1-5, An-Nas 114:1-6. Whoever recites these three times in the morning and in the evening, they will suffice him (as a protection) against everything.",
    "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmidhi 5/567. See Al-Albani's Sahih At-Tirmidhi 3/182.",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/113.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 6,
    "content": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
    "translation": "(1) Say, I seek refuge in the Lord of mankind (2) The Sovereign of mankind (3) The God of mankind (4) From the evil of the retreating whisperer (5) Who whispers [evil] into the breasts of mankind (6) From among the jinn and mankind.",
    "transliteration": "Bismillaahir Rahmaanir Raheem \"Qul a'oozu birabbin naas (1)\nMalikin naas (2)\nIlaahin naas (3)\nMin sharril waswaasil khannaas (4)\nAllazee yuwaswisu fee sudoorin naas (5)\nMinal jinnati wannaas (6)",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Al-Ikhlas 112:1-4, Al-Falaq 113:1-5, An-Nas 114:1-6. Whoever recites these three times in the morning and in the evening, they will suffice him (as a protection) against everything.",
    "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmidhi 5/567. See Al-Albani's Sahih At-Tirmidhi 3/182.",
    "type": 0,
    "audio": "https://server8.mp3quran.net/afs/114.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ أَبِي أَسِيدٍ الْبَرَّادِ ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ لَنَا، فَأَدْرَكْنَاهُ، فَقَالَ: \"أَصَلَّيْتُمْ ؟\". فَلَمْ أَقُلْ شَيْئًا، فَقَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ: \"قُلْ\". فَقُلْتُ: يَا رَسُولَ اللَّهِ، مَا أَقُولُ ؟ قَالَ: \"قُلْ (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي وَحِينَ تُصْبِحُ ثَلَاثَ مَرَّاتٍ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ\".",
    "explanation_of_hadith_vocabulary": "(والمعوذتين) أي: {قل أعوذ برب الفلق} و {قل أعوذ برب الناس}.\n(ثلاث مرات) أي: قل ثلاث مرات.\n(تكفيك) أي: هذه السور الثلاث.\n(من كل شيء) أي: من كل شر أو كل ورد يتعوذ به."
  },
  {
    "order": 7,
    "content": "أَصْبَحْنَا وَأَصْبَحَ الْملْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْملْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "translation": "We have reached the morning and at this very time unto Allah belongs all sovereignty, and all praise is for Allah. None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent. My Lord, I ask You for the good of this day and the good of what follows it and I take refuge in You from the evil of this day and the evil of what follows it. My Lord, I take refuge in You from laziness and senility. My Lord, I take refuge in You from torment in the Fire and punishment in the grave.",
    "transliteration": "Asbahna wa-asbahal-mulku lillah, walhamdu lillah, la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathal-yawm, wakhayra ma baAAdahu, wa-aAAoothu bika min sharri hathal-yawm, washarri ma baAAdahu, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Muslim, 4/2088, No. 2723",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/77.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ النَّخَعِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمْسَى قَالَ: \"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\". قَالَ الْحَسَنُ: فَحَدَّثَنِي الزُّبَيْدُ أَنَّهُ حَفِظَ عَنْ إِبْرَاهِيمَ فِي هَذَا \"لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ، وَعَذَابٍ فِي الْقَبْرِ\".",
    "explanation_of_hadith_vocabulary": "‏قوله صلى الله عليه وسلم: (اللهم إني أعوذ بك من الكسل وسوء الكبر) قال القاضي: رويناه \"الكبر \"بإسكان الباء وفتحها، فالإسكان بمعنى: التعاظم على الناس، والفتح بمعنى: الهرم والخرف والرد إلى أرذل العمر، كما في الحديث الآخر، قال القاضي: وهذا أظهر وأشهر مما قبله، قال: وبالفتح ذكره الهروي، وبالوجهين ذكره الخطابي، وصوب الفتح، وتعضده رواية النسائي: \"وسوء العمر \"."
  },
  {
    "order": 8,
    "content": "أمسينا وأمسى الملك للَّه، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة، وشر ما بعدها، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "translation": "We have reached the evening and at this very time unto Allah belongs all sovereignty, and all praise is for Allah. None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it. My Lord, I take refuge in You from laziness and senility. My Lord, I take refuge in You from torment in the Fire and punishment in the grave.",
    "transliteration": "Amsayna wa-amsal-mulku lillah, walhamdu lillah, la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathihil-laylah, wakhayra ma baAAdaha, wa-aAAoothu bika min sharri hathihil-laylah, washarri ma baAAdaha, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Muslim, 4/2088, No. 2723",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/77.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ النَّخَعِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمْسَى قَالَ: \"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\". قَالَ الْحَسَنُ: فَحَدَّثَنِي الزُّبَيْدُ أَنَّهُ حَفِظَ عَنْ إِبْرَاهِيمَ فِي هَذَا \"لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ، وَعَذَابٍ فِي الْقَبْرِ\".",
    "explanation_of_hadith_vocabulary": "‏قوله صلى الله عليه وسلم: (اللهم إني أعوذ بك من الكسل وسوء الكبر) قال القاضي: رويناه \"الكبر \"بإسكان الباء وفتحها، فالإسكان بمعنى: التعاظم على الناس، والفتح بمعنى: الهرم والخرف والرد إلى أرذل العمر، كما في الحديث الآخر، قال القاضي: وهذا أظهر وأشهر مما قبله، قال: وبالفتح ذكره الهروي، وبالوجهين ذكره الخطابي، وصوب الفتح، وتعضده رواية النسائي: \"وسوء العمر \"."
  },
  {
    "order": 9,
    "content": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
    "translation": "O Allah, by Your leave we have reached the morning and by Your leave we have reached the evening, by Your leave we live and die and unto You is our resurrection",
    "transliteration": "Allahumma bika asbahna, wabika amsayna, wabika nahya, wabika namootu wa-ilaykan-nushoor.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Al-Tirmidhi, 5/466, No. 3391, and see: Sahih Al-Tirmidhi 3/142",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/78.mp3",
    "hadith_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُ أَصْحَابَهُ يَقُولُ:\"إِذَا أَصْبَحَ أَحَدُكُمْ ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ، وَإِذَا أَمْسَى ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ ",
    "explanation_of_hadith_vocabulary": "النشور: البعث يوم القيامة."
  },
  {
    "order": 10,
    "content": "اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نموتُ، وإليكَ المصيرُ",
    "translation": "O Allah, by Your leave we have reached the evening and by Your leave we have reached the morning, by Your leave we live and die and unto You is our return.",
    "transliteration": "Allahumma bika amsayna, wabika asbahna, wabika nahya, wabika namootu wa-ilaykal-maseer.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Al-Tirmidhi, 5/466, No. 3391, and see: Sahih Al-Tirmidhi 3/142",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/78.mp3",
    "hadith_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُ أَصْحَابَهُ يَقُولُ:\"إِذَا أَصْبَحَ أَحَدُكُمْ ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ، وَإِذَا أَمْسَى ؛ فَلْيَقُلِ: اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ ",
    "explanation_of_hadith_vocabulary": "النشور: البعث يوم القيامة."
  },
  {
    "order": 11,
    "content": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ",
    "translation": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed.  I acknowledge Your favour upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You.",
    "transliteration": "Allahumma anta rabbee la ilaha illa ant, khalaqtanee wa-ana AAabduk, wa-ana AAala AAahdika wawaAAdika mas-tataAAt, aAAoothu bika min sharri ma sanaAAt, aboo-o laka biniAAmatika AAalay, wa-aboo-o bithanbee, faghfir lee fa-innahu la yaghfiruth-thunooba illa ant.",
    "count": 1,
    "count_description": "Once",
    "fadl": "Whoever recites this with conviction in the evening and dies during that night shall enter Paradise, and whoever recites it with conviction in the morning and dies during that day shall enter Paradise",
    "source": "Narrated by Al-Bukhari, 7/150, No. 6306",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/79.mp3",
    "hadith_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، قَالَ: حَدَّثَنِي شَدَّادُ بْنُ أَوْسٍ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ: اللَّهُمَّ أَنْتَ رَبِّي، لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي ؛ فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ\". قَالَ: \"وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ\".",
    "explanation_of_hadith_vocabulary": "أبوء: أقر وأعترف."
  },
  {
    "order": 12,
    "content": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
    "translation": "O Allah, verily I have reached the morning and call on You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner, and that Muhammad is Your Servant and Messenger.",
    "transliteration": "Allahumma innee asbahtu oshhiduka, wa-osshidu hamalata AAarshika, wamala-ikatika, wajameeAAa khalqika, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluka.",
    "count": 4,
    "count_description": "Four times",
    "fadl": "Allah will spare whoever says this four times in the morning or evening from the fire of Hell.",
    "source": "It was narrated by Abu Dawood, 4/317, No. 5069, and by Al-Bukhari in Al-Adab Al-Mufrad, No. 1201, and by Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 9, and by Ibn Al-Sunni, No. 70. Sheikh Ibn Baz classified the isnad of Al-Nasa'i and Abu Dawood as hasan in Tuhfat Al-Akhyar, p. 23.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/80.mp3",
    "hadith_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ هِشَامِ بْنِ الْغَازِ بْنِ رَبِيعَةَ، عَنْ مَكْحُولٍ الدِّمَشْقِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ أَوْ يُمْسِي: اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ. أَعْتَقَ اللَّهُ رُبُعَهُ مِنَ النَّارِ، فَمَنْ قَالَهَا مَرَّتَيْنِ أَعْتَقَ اللَّهُ نِصْفَهُ، وَمَنْ قَالَهَا ثَلَاثًا أَعْتَقَ اللَّهُ ثَلَاثَةَ أَرْبَاعِهِ، فَإِنْ قَالَهَا أَرْبَعًا أَعْتَقَهُ اللَّهُ مِنَ النَّارِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 13,
    "content": "اللَّهم إني أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
    "translation": "O Allah, verily I have reached the evening and call on You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner, and that Muhammad is Your Servant and Messenger.",
    "transliteration": "Allahumma innee amsaytu oshhiduka, wa-osshidu hamalata AAarshika, wamala-ikatika, wajameeAAa khalqika, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluka.",
    "count": 4,
    "count_description": "Four times",
    "fadl": "Allah will spare whoever says this four times in the morning or evening from the fire of Hell.",
    "source": "It was narrated by Abu Dawood, 4/317, No. 5069, and by Al-Bukhari in Al-Adab Al-Mufrad, No. 1201, and by Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 9, and by Ibn Al-Sunni, No. 70. Sheikh Ibn Baz classified the isnad of Al-Nasa'i and Abu Dawood as hasan in Tuhfat Al-Akhyar, p. 23.",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/80.mp3",
    "hadith_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ هِشَامِ بْنِ الْغَازِ بْنِ رَبِيعَةَ، عَنْ مَكْحُولٍ الدِّمَشْقِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ أَوْ يُمْسِي: اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ. أَعْتَقَ اللَّهُ رُبُعَهُ مِنَ النَّارِ، فَمَنْ قَالَهَا مَرَّتَيْنِ أَعْتَقَ اللَّهُ نِصْفَهُ، وَمَنْ قَالَهَا ثَلَاثًا أَعْتَقَ اللَّهُ ثَلَاثَةَ أَرْبَاعِهِ، فَإِنْ قَالَهَا أَرْبَعًا أَعْتَقَهُ اللَّهُ مِنَ النَّارِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 14,
    "content": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "translation": "O Allah, what blessing I or any of Your creation have risen upon is from You alone, without partner. So for You is all praise and unto You all thanks.",
    "transliteration": "Allahumma ma asbaha bee min niAAmatin, aw bi-ahadin min khalqika, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.",
    "count": 1,
    "count_description": "Once",
    "fadl": "Whoever recites this in the morning, has completed his obligation to thank Allah for that day; and whoever says it in the evening, has completed his obligation for that night.",
    "source": "It was narrated by Abu Dawood, 4/318, No. 5073, and by Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 7, and by Ibn Al-Sunni, No. 41, and by Ibn Hibban in Mawarid, No. 2361. Sheikh Ibn Baz classified the isnad as hasan in Tuhfat Al-Akhyar, p. 24.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/81.mp3",
    "hadith_text": ",حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ وَإِسْمَاعِيلُ، قَالَا: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَنْبَسَةَ، عَنْ عَبْدِ اللَّهِ بْنِ غَنَّامٍ الْبَيَاضِيِّ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. فَقَدْ أَدَّى شُكْرَ يَوْمِهِ، وَمَنْ قَالَ مِثْلَ ذَلِكَ حِينَ يُمْسِي فَقَدْ أَدَّى شُكْرَ لَيْلَتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 15,
    "content": "اللَّهم ما أمسى بي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "translation": "O Allah, what blessing I or any of Your creation have reached the evening upon is from You alone, without partner. So for You is all praise and unto You all thanks",
    "transliteration": "Allahumma ma amsa bee min niAAmatin, aw bi-ahadin min khalqika, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.",
    "count": 1,
    "count_description": "Once",
    "fadl": "Whoever recites this in the morning, has completed his obligation to thank Allah for that day; and whoever says it in the evening, has completed his obligation for that night.",
    "source": "It was narrated by Abu Dawood, 4/318, No. 5073, and by Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 7, and by Ibn Al-Sunni, No. 41, and by Ibn Hibban in Mawarid, No. 2361. Sheikh Ibn Baz classified the isnad as hasan in Tuhfat Al-Akhyar, p. 24.",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/81.mp3",
    "hadith_text": ",حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ وَإِسْمَاعِيلُ، قَالَا: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَنْبَسَةَ، عَنْ عَبْدِ اللَّهِ بْنِ غَنَّامٍ الْبَيَاضِيِّ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. فَقَدْ أَدَّى شُكْرَ يَوْمِهِ، وَمَنْ قَالَ مِثْلَ ذَلِكَ حِينَ يُمْسِي فَقَدْ أَدَّى شُكْرَ لَيْلَتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 16,
    "content": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
    "translation": "(O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health.  None has the right to be worshipped except You.) (O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave.  None has the right to be worshipped except You.)",
    "transliteration": "(Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.) (Allahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant.)",
    "count": 3,
    "count_description": "Three times",
    "fadl": "",
    "source": "Abu Dawud 4/324, Ahmad 5/42, An-Nasa'i, 'Amalul-Yawm wal-Laylah (No. 22), Ibn As-Sunni (No. 69), Al-Bukhari Al-'Adab Al-Mufrad. Its chain of transmission is good (Hasan), Ibn Baz, p. 26.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/82.mp3",
    "hadith_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، عَنْ عَبْدِ الْجَلِيلِ بْنِ عَطِيَّةَ، عَنْ جَعْفَرِ بْنِ مَيْمُونٍ، قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، أَنَّهُ قَالَ لِأَبِيهِ: يَا أَبَتِ، إِنِّي أَسْمَعُكَ تَدْعُو كُلَّ غَدَاةٍ: \"اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ\". تُعِيدُهَا ثَلَاثًا حِينَ تُصْبِحُ، وَثَلَاثًا حِينَ تُمْسِي ؟ فَقَالَ: إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِنَّ، فَأَنَا أُحِبُّ أَنْ أَسْتَنَّ بِسُنَّتِهِ. قَالَ عَبَّاسٌ فِيهِ: وَتَقُولُ: \"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ\". تُعِيدُهَا ثَلَاثًا حِينَ تُصْبِحُ وَثَلَاثًا حِينَ تُمْسِي، فَتَدْعُو بِهِنَّ، فَأُحِبُّ أَنْ أَسْتَنَّ بِسُنَّتِهِ. قَالَ: وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"دَعَوَاتُ الْمَكْرُوبِ: اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أَنْتَ\". وَبَعْضُهُمْ يَزِيدُ عَلَى صَاحِبِهِ.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 17,
    "content": "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "translation": "Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne.",
    "transliteration": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem",
    "count": 7,
    "count_description": "Seven times",
    "fadl": "Allah will grant whoever recites this seven times in the morning or evening whatever he desires from this world or the next",
    "source": "It was narrated by Ibn As-Sunni, No. 71, attributed directly to the Prophet (Marfu'), and by Abu Dawud as a statement of a Companion (Mawquf), 4/321, No. 5081. The chain of transmission was authenticated by Shu'ayb and 'Abd al-Qadir al-Arna'ut. See: Zad Al-Ma'ad 2/376.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/83.mp3",
    "hadith_text": "لفظ أبو داود: حَدَّثَنَا يَزِيدُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ مُسْلِمٍ الدِّمَشْقِيُّ - وَكَانَ مِنْ ثِقَاتِ الْمُسْلِمِينَ مِنَ الْمُتَعَبِّدِينَ - قَالَ: حَدَّثَنَا مُدْرِكُ بْنُ سَعْدٍ - قَالَ يَزِيدُ: شَيْخٌ ثِقَةٌ - عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى: { حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ } سَبْعَ مَرَّاتٍ كَفَاهُ اللَّهُ مَا أَهَمَّهُ، صَادِقًا كَانَ بِهَا أَوْ كَاذِبًا.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 18,
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
    "translation": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth.",
    "transliteration": "Allahumma innee as-alukal-AAafwa walAAafiyah, fid-dunya wal-akhirah, allahumma innee as-alukal-AAafwa walAAafiyah fee deenee, wadunyaya wa-ahlee, wamalee, allahummas-tur AAawratee, wa-amin rawAAatee, allahummah-fathnee min bayni yaday, wamin khalfee, waAAan yameenee, waAAan shimalee, wamin fawqee, wa-aAAoothu biAAathamatika an oghtala min tahtee.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Abu Dawood, No. 5074, and Ibn Majah, No. 3871. See: Sahih Ibn Majah, 2/332.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/84.mp3",
    "hadith_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى، حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا عُبَادَةُ بْنُ مُسْلِمٍ الْفَزَارِيُّ، عَنْ جُبَيْرِ بْنِ أَبِي سُلَيْمَانَ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ يَقُولُ: لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ: \"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَتِي - وَقَالَ عُثْمَانُ: عَوْرَاتِي - وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي\". \nقَالَ أَبُو دَاوُدَ: قَالَ وَكِيعٌ: يَعْنِي الْخَسْفَ.",
    "explanation_of_hadith_vocabulary": "- رَوْعَاتِي: جمع رَوعة، وهي الفزعة، والمعنى: ادفع عني ما يفزعني ويزعجني.\n- أُغْتَالَ: أي: أهلك من حيث لا أشعر، يريد به الخسف."
  },
  {
    "order": 19,
    "content": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "translation": "(O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.)(shirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.)",
    "transliteration": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharrish-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw ajurrahu ila muslim.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Al-Tirmidhi, No. 3392, and Abu Dawood, No. 5067. See: Sahih Al-Tirmidhi, 3/142.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/85.mp3",
    "hadith_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، قَالَ: حَدَّثَنَا أَبُو دَاوُدَ، قَالَ: أَخْبَرَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، قَالَ: سَمِعْتُ عَمْرَو بْنَ عَاصِمٍ الثَّقَفِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللَّهِ، مُرْنِي بِشَيْءٍ أَقُولُهُ إِذَا أَصْبَحْتُ، وَإِذَا أَمْسَيْتُ، قَالَ: \"قُلِ: اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ\". قَالَ: \"قُلْهُ إِذَا أَصْبَحْتَ، وَإِذَا أَمْسَيْتَ، وَإِذَا أَخَذْتَ مَضْجَعَكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 20,
    "content": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing.",
    "transliteration": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem.",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Whoever recites it three times in the morning will not be afflicted by any calamity before evening, and whoever recites it three times in the evening will not be overtaken by any calamity before morning.",
    "source": "It was narrated by Abu Dawood, 4/323, No. 5088, Al-Tirmidhi, 5/465, No. 3388, Ibn Majah, No. 3869, and Ahmad, No. 446. See: Sahih Ibn Majah, 2/332. Sheikh Ibn Baz classified the isnad as hasan in Tuhfat Al-Akhyar, p. 39.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/86.mp3",
    "hadith_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا أَبُو مَوْدُودٍ، عَمَّنْ سَمِعَ أَبَانَ بْنَ عُثْمَانَ يَقُولُ: سَمِعْتُ عُثْمَانَ - يَعْنِي ابْنَ عَفَّانَ - يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"مَنْ قَالَ: بِاسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ، ثَلَاثَ مَرَّاتٍ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ\". قَالَ: فَأَصَابَ أَبَانَ بْنَ عُثْمَانَ الْفَالِجُ، فَجَعَلَ الرَّجُلُ الَّذِي سَمِعَ مِنْهُ الْحَدِيثَ يَنْظُرُ إِلَيْهِ، فَقَالَ لَهُ: مَا لَكَ تَنْظُرُ إِلَيَّ ؟ فَوَاللَّهِ مَا كَذَبْتُ عَلَى عُثْمَانَ، وَلَا كَذَبَ عُثْمَانُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَلَكِنَّ الْيَوْمَ الَّذِي أَصَابَنِي فِيهِ مَا أَصَابَنِي غَضِبْتُ فَنَسِيتُ أَنْ أَقُولَهَا.",
    "explanation_of_hadith_vocabulary": "الفالج: شلل يصيب أحد شقي الجسم طولا."
  },
  {
    "order": 21,
    "content": "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ ﷺ نَبِيًّا",
    "translation": "I am pleased with Allah as a Lord, and Islam as a religion and Muhammad  as a Prophet.",
    "transliteration": "Radeetu billahi rabban wabil-islami deenan wabiMuhammadin nabiyya.",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Allah has promised that anyone who says this three times every morning or evening will be pleased on the Day of Resurrection.",
    "source": "Ahmad, 4/337, No. 18967, Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 4, Ibn Al-Sunni, No. 68, Abu Dawood, 4/318, No. 1531, and Al-Tirmidhi, 5/465, No. 3389. Sheikh Ibn Baz classified it as hasan in Tuhfat Al-Akhyar, p. 39.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/87.mp3",
    "hadith_text": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَقِيلٍ - قَاضِي وَاسِطٍ - عَنْ سَابِقِ بْنِ نَاجِيَةَ، عَنْ أَبِي سَلَّامٍ، قَالَ: مَرَّ رَجُلٌ فِي مَسْجِدِ حِمْصَ، فَقَالُوا: هَذَا خَدَمَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ: فَقُمْتُ إِلَيْهِ، فَقُلْتُ: حَدِّثْنِي حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، لَا يَتَدَاوَلُهُ بَيْنَكَ وَبَيْنَهُ الرِّجَالُ. قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ: رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا. إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 22,
    "content": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "translation": "O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.",
    "transliteration": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha/nee kullah, wala takilnee ila nafsee tarfata AAayn.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Its chain of transmission is sound (Sahih), Al-Hakim 1/545, see Albani, Sahihut-Targhib wat-Tarhib, 1/273.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/88.mp3",
    "hadith_text": "قالَ رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ لفاطمةَ: ما يَمنعُكِ أنْ تَسمَعي ما أُوصيكِ به أنْ تَقولي إذا أَصبحتِ، وإذا أَمسيتِ: يا حيُّ يا قيُّومُ برحمتِكَ أَستغيثُ، أَصلِحْ لي شأني كُلَّهُ، ولا تَكِلْني إلى نَفسي طرْفةَ عينٍ",
    "explanation_of_hadith_vocabulary": "كان النَّبيُّ صلَّى اللهُ عليه وسلَّم خَيرَ النَّاسِ لأهلِه وأولادِه، فكان يَحرِصُ على أن يُعَلِّمَهم ما يَنفعُهم في دينِهم، ويوصيهم بالخَيرِ، ومن ذلك أنَّه صلَّى اللهُ عليه وسلَّم قال لابنَتِه فاطِمةَ رَضِيَ اللهُ عنها: ما يَمنَعُكِ أن تَسمَعي ما أوصيك به؟ أي: هل هناكَ شَيءٌ يَحولُ بَينَك وبَينَ سَماعِ وصيَّتي لكِ؟ ثمَّ أوصاها إذا أصبَحَت -أي: دَخَلت في وقتِ الصَّباحِ-، وإذا أمسَت -أي: دَخَلت في وقتِ المَساءِ- أن تَقولَ: يا حَيُّ يا قَيُّومُ، وهما اسمانِ من أسماءِ اللهِ تعالى، فالحَيُّ: جامِعٌ لصِفاتِ الذَّاتِ، والقَيُّومُ: جامِعٌ لصِفاتِ الأفعالِ، وجَمعُهما في غايةِ المُناسَبةِ كما جَمَعَهما اللهُ في عِدَّةِ مَواضِعَ من كِتابِه؛ وذلك أنَّهما مُحتَويانِ على جَميعِ صِفاتِ الكَمالِ، بك أستَغيثُ، أي: أطلُبُ الغَوثَ منك يا اللَّهُ، أن تُصلِحَ لي شَأني، أي: أمري، بأن تَجعَلَه صالحًا لا فسادَ يَلحَقُه، ولا تَكِلْني، أي: لا تَترُكْني إلى نَفسي وتَدبيرِها ونَظَرِها لِما يَنفعُها؛ فإنَّ النَّفسَ عاجِزةٌ عن مَعرِفةِ مَصلحَتِها، طَرفةَ عَينٍ، أي: لحظةً ولمحةً، والمَعنى: لا تُفوِّضْ أمري إلى نَفسي لحظةً قَليلةً قَدْرَ ما يَتَحَرَّكُ البَصَرُ.\nوفي الحَديثِ: بَيانُ ما كان عليه النَّبيُّ صلَّى اللهُ عليه وسلَّم منَ الاهتِمامِ بأبنائِه.\nوفيه أهَمِّيَّةُ رِعايةِ الأولادِ وتَعليمِهم ما يَنفعُهم في دينِهم ودُنياهم.\nوفيه مَشروعيَّةُ قَولِ: يا حَيُّ يا قَيُّومُ، بك أستَغيثُ؛ فأصلِحْ لي شَأني، ولا تَكِلْني إلى نَفسي طَرفةَ عَينٍ في الصَّباحِ والمَساءِ.\nوفيه سُؤالُ اللهِ تعالى بأسمائِه الحُسنى.\nوفيه تَفويضُ العَبدِ جَميعَ أمورِه إلى اللهِ تعالى."
  },
  {
    "order": 23,
    "content": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
    "translation": "We have reached the morning and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this day, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this day and the evil that follows it.",
    "transliteration": "Asbahna wa-asbahal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathal-yawm, fat-hahu, wanasrahu, wanoorahu, wabarakatahu, wahudahu, wa-aAAoothu bika min sharri ma feehi, washarri ma baAAdah.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Abu Dawud 4/322. Its transmission chain is good (Hasan). See also Ibn Al-Qayyim, Zadul- Ma'ad 2/273.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/89.mp3",
    "hadith_text": "قَالَ أَبُو دَاوُدَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنِي  أَبِي - قَالَ ابْنُ عَوْفٍ: وَرَأَيْتُهُ فِي أَصْلِ إِسْمَاعِيلَ - قَالَ: حَدَّثَنِي ضَمْضَمٌ، عَنْ شُرَيْحٍ، عَنْ أَبِي مَالِكٍ وَبِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ ؛ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ. ثُمَّ إِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 24,
    "content": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا",
    "translation": "We have reached the evening and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of tonight, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of tonight and the evil that follows it.",
    "transliteration": "Amsayna wa-amsal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathihil-laylah, fat-haha, wanasraha, wanooraha, wabarakataha, wahudaha, wa-aAAoothu bika min sharri ma feeha, washarri ma baAAdaha.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Abu Dawud 4/322. Its transmission chain is good (Hasan). See also Ibn Al-Qayyim, Zadul- Ma'ad 2/273.",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/89.mp3",
    "hadith_text": "قَالَ أَبُو دَاوُدَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنِي  أَبِي - قَالَ ابْنُ عَوْفٍ: وَرَأَيْتُهُ فِي أَصْلِ إِسْمَاعِيلَ - قَالَ: حَدَّثَنِي ضَمْضَمٌ، عَنْ شُرَيْحٍ، عَنْ أَبِي مَالِكٍ وَبِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ ؛ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ. ثُمَّ إِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 25,
    "content": "أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
    "translation": "We rise upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad ﷺ, and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.",
    "transliteration": "Asbahna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad ﷺ, waAAala millati abeena Ibraheem, haneefan musliman wama kana minal-mushrikeen.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Ahmad, 3/406 and 407, nos. 15360 and 15563, and Ibn Al-Sunni in 'Amal Al-Yawm wal-Laylah, No. 34. See: Sahih Al-Jami', 4/209.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/90.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \"أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ\".",
    "explanation_of_hadith_vocabulary": "قوله (أصبحنا) أي: دخلنا في الصباح، وهذا الدعاء من أذكار الصباح (على فطرة الإسلام) الجار والمجرور حال: ونحن على فطرة الإسلام، أي: على السنة التي سنها الله تعالى لعباده، وهي الإسلام، فالإضافة بيانية (كلمة الإخلاص) أي: كلمة تدل على إخلاص القائل ويصير بها القائل من المخلصين، وهي كلمة التوحيد (وعلى دين نبينا) يدل على أن النبي مبعوث إلى نفسه حتى له أن يضيف اسم النبي إلى نفسه  لذلك (ملة أبينا) أي: دينه (حنيفا) مائلا عن الباطل حال من (إبراهيم)."
  },
  {
    "order": 26,
    "content": "أمسينا على فطرة الإسلام، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
    "translation": "We have entered the evening upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad ﷺ, and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.",
    "transliteration": "Amsayna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad ﷺ, waAAala millati abeena Ibraheem, haneefan musliman wama kana minal-mushrikeen.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "Ahmad, 3/406 and 407, nos. 15360 and 15563, and Ibn Al-Sunni in 'Amal Al-Yawm wal-Laylah, No. 34. See: Sahih Al-Jami', 4/209.",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/90.mp3",
    "hadith_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \"أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ\".",
    "explanation_of_hadith_vocabulary": "قوله (أصبحنا) أي: دخلنا في الصباح، وهذا الدعاء من أذكار الصباح (على فطرة الإسلام) الجار والمجرور حال: ونحن على فطرة الإسلام، أي: على السنة التي سنها الله تعالى لعباده، وهي الإسلام، فالإضافة بيانية (كلمة الإخلاص) أي: كلمة تدل على إخلاص القائل ويصير بها القائل من المخلصين، وهي كلمة التوحيد (وعلى دين نبينا) يدل على أن النبي مبعوث إلى نفسه حتى له أن يضيف اسم النبي إلى نفسه  لذلك (ملة أبينا) أي: دينه (حنيفا) مائلا عن الباطل حال من (إبراهيم)."
  },
  {
    "order": 27,
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
    "translation": "O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable.",
    "transliteration": "Allahumma innee as-aluka AAilman nafiAAan, warizqan tayyiban, waAAamalan mutaqabbalan.",
    "count": 1,
    "count_description": "Once",
    "fadl": "",
    "source": "It was narrated by Ibn Al-Sunni in 'Amal Al-Yawm wal-Laylah, No. 54, and by Ibn Majah, No. 925. The chain of transmission was classified as hasan by 'Abd al-Qadir and Shu'ayb al-Arna'ut in their verification of Zad Al-Ma'ad, 2/375.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/95.mp3",
    "hadith_text": "925 حدثنا أبو بكر بن أبي شيبة حدثنا شبابة حدثنا شعبة عن موسى بن أبي عائشة عن مولى لأم سلمة عن أم سلمة أن النبي صلى الله عليه وسلم كانَ يقولُ إذا صلَّى الصُّبحَ حينَ يسلِّمُ اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 28,
    "content": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.",
    "transliteration": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.",
    "count": 10,
    "count_description": "Ten times or once when lazy",
    "fadl": "Ten times or once when feeling lazy, and whoever says it ten times, it is as if he has freed four souls from the descendants of Isma'il.",
    "source": "Sahih Al-Bukhari: 6404, Sahih Muslim: 2693, Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 24. See: Sahih Al-Targhib wal-Tarhib, 1/272, Tuhfat Al-Akhyar by Ibn Baz, p. 44, and its virtue in: p. 146, hadith No. 255. Once when feeling lazy: Abu Dawood, No. 5077, Ibn Majah, No. 3798, Ahmad, No. 8719. See: Sahih Al-Targhib wal-Tarhib, 1/270, Sahih Abi Dawood, 3/957, Sahih Ibn Majah, 2/331, and Zad Al-Ma'ad, 2/377.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/92.mp3",
    "hadith_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ أَبُو أَيُّوبَ الْغَيْلَانِيُّ، حَدَّثَنَا أَبُو عَامِرٍ - يَعْنِي الْعَقَدِيَّ - حَدَّثَنَا عُمَرُ - وَهُوَ ابْنُ أَبِي زَائِدَةَ - عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ: مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. عَشْرَ مِرَارٍ - كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ. وَقَالَ سُلَيْمَانُ: حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا عُمَرُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ رَبِيعِ بْنِ خُثَيْمٍ، بِمِثْلِ ذَلِكَ، قَالَ: فَقُلْتُ لِلرَّبِيعِ: مِمَّنْ سَمِعْتَهُ ؟ قَالَ: مِنْ عَمْرِو بْنِ مَيْمُونٍ. قَالَ: فَأَتَيْتُ عَمْرَو بْنَ مَيْمُونٍ، فَقُلْتُ: مِمَّنْ سَمِعْتُهُ ؟ قَالَ: مِنِ ابْنِ أَبِي لَيْلَى. قَالَ: فَأَتَيْتُ ابْنَ أَبِي لَيْلَى، فَقُلْتُ: مِمَّنْ سَمِعْتُهُ ؟ قَالَ: مِنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ يُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 29,
    "content": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
    "translation": "O Allaah, send prayers and peace upon our Prophet Muhammad.",
    "transliteration": "Allaahumma salli wa sallim 'alaa Nabiyyinaa Muhammadin",
    "count": 10,
    "count_description": "Ten times",
    "fadl": "The Prophet (ﷺ) said: \"Who recites blessings upon me ten times in the morning and ten times in the evening will obtain my intercession on the Day of Resurrection.",
    "source": "It was narrated by Al-Tabarani with two isnads, one of which is good. See: Majma' Al-Zawa'id, 10/120, and Sahih Al-Targhib wal-Tarhib, 1/273 [No. 656], and Da'if Al-Targhib wal-Tarhib, No. 396, and in Al-Silsilah Al-Da'ifah, No. 5788.",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/98.mp3",
    "hadith_text": "عن أبي الدرداء- رضي الله تعالى عنه- قال: قال رسول الله -صلى الله عليه وسلم-: (من صلَّى عليَّ حينَ يصبحُ عشرًا وحينَ يمسي عشرًا أدرَكتْهُ شفاعتي يومَ القيامةِ)",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 30,
    "content": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "translation": "I take refuge in Allah’s perfect words from the evil He has created.",
    "transliteration": "aAAoothu bikalimatil-lahit-tammati min sharri ma khalaq.",
    "count": 3,
    "count_description": "Three times",
    "fadl": "Whoever recites this three times in the evening will be protected from insect stings",
    "source": "Ahmad 2/ 290, An-Nasa'i, 'Amalul-Yawm wal-Laylah No. 590, At-Tirmidhi 3/187, Ibn As-Sunni No. 68. According to Al-Albani, Ibn Majah's (2/266) chain of transmission is sound (Sahih), and following Ibn Baz 45, At-Tirmidhi's report is good (Hasan).",
    "type": 2,
    "audio": "http://www.hisnmuslim.com/audio/ar/97.mp3",
    "hadith_text": "حَدَّثَنَا يَزِيدُ، أَخْبَرَنَا هِشَامٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَنْ قَالَ إِذَا أَمْسَى ثَلَاثَ مَرَّاتٍ: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ، لَمْ تَضُرَّهُ حُمَةٌ تِلْكَ اللَّيْلَةَ\". قَالَ: فَكَانَ أَهْلُنَا قَدْ تَعَلَّمُوهَا فَكَانُوا يَقُولُونَهَا، فَلُدِغَتْ جَارِيَةٌ مِنْهُمْ، فَلَمْ تَجِدْ لَهَا وَجَعًا.",
    "explanation_of_hadith_vocabulary": "قوله (التامات): الوافيات في أداء معانيها أو الكاملات: التي لا نقص في شيء منها ولا عيب أو النافعات للمتعوذ بها الحافظات له من الآفات. قيل: هي علمه تعالى أو كلامه أو القرآن وقيل: أراد بها أسماءه الحسنى وكتبه المنزلة لخلوها من النواقص والعوارض بخلاف كلمات الناس. (حمة) بضم مهملة وتخفيف ميم وتشديد: السم ويطلق على إبرة العقرب المجاورة لأن السم منها يخرج."
  },
  {
    "order": 31,
    "content": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ",
    "translation": "How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words.",
    "transliteration": "Subhanal-lahi wabihamdih, AAadada khalqihi warida nafsih, wazinata AAarshih, wamidada kalimatih.",
    "count": 3,
    "count_description": "Three times",
    "fadl": "",
    "source": "Muslim 4/2090, No. 2726",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/94.mp3",
    "hadith_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ - قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ، فَقَالَ: \"مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا ؟ \"قَالَتْ: نَعَمْ. قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 32,
    "content": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.",
    "transliteration": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.",
    "count": 100,
    "count_description": "One hundred times",
    "fadl": "Whoever recites this one hundred times a day will have the reward of freeing ten slaves. One hundred Hasanaat (rewards) will be written for him and one hundred misdeeds will be washed away. He will be shielded from Satan until the evening. No one will be able to present anything better than this except for someone who has recited more than this.",
    "source": "Al-Bukhari, 4/95, No. 3293, and Muslim, 4/2071, No. 2691. Ten times: Al-Nasa'i in 'Amal Al-Yawm wal-Laylah, No. 24. See: Sahih Al-Targhib wal-Tarhib, 1/272, and Tuhfat Al-Akhyar by Ibn Baz, p. 44, and its virtue in: p. 146, hadith No. 255. Once when feeling lazy: Abu Dawood, No. 5077, Ibn Majah, No. 3798, Ahmad, No. 8719. See: Sahih Al-Targhib wal-Tarhib, 1/270, Sahih Abi Dawood, 3/957, Sahih Ibn Majah, 2/331, and Zad Al-Ma'ad, 2/377.",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/93.mp3",
    "hadith_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 33,
    "content": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
    "translation": "I seek Allaah’s forgiveness and I turn to Him in repentance.",
    "transliteration": "Astaghfirullaaha wa 'atoobu 'ilayhi",
    "count": 100,
    "count_description": "One hundred times a day",
    "fadl": "",
    "source": "Al-Bukhari with Al-Fath, 11/101 [No. 6307], and Muslim, 4/2075 [No. 2702].",
    "type": 1,
    "audio": "http://www.hisnmuslim.com/audio/ar/96.mp3",
    "hadith_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"وَاللَّهِ إِنِّي لَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً\".",
    "explanation_of_hadith_vocabulary": ""
  },
  {
    "order": 34,
    "content": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "translation": "How perfect Allah is and I praise Him.",
    "transliteration": "Subhanal-lahi wabihamdih.",
    "count": 100,
    "count_description": "One hundred times",
    "fadl": "Whoever recites this one hundred times in the morning and in the evening will not be surpassed on the Day of Resurrection by anyone having done better than this except for someone who had recited it more.",
    "source": "Muslim 2692",
    "type": 0,
    "audio": "http://www.hisnmuslim.com/audio/ar/91.mp3",
    "hadith_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، عَنْ سُهَيْلٍ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ. مِائَةَ مَرَّةٍ - لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ، أَوْ زَادَ عَلَيْهِ\".",
    "explanation_of_hadith_vocabulary": ""
  }
]
